# MinorSpacingFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..MinorSpacingFailure Property
BuiltInFailures..::..FabricFailures Class See Also
---
The spacing in the minor direction is lower than diameter of the wire in the major direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MinorSpacingFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MinorSpacingFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MinorSpacingFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace